ruby_notes/app/models/book.rb

SELECT 1 AS one FROM "notes" WHERE "notes"."book_id" = ? AND "notes"."id" = ? LIMIT ?  [["book_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def containNote(id)
    ok = false
    if self.notes.exists? (id)