ruby_notes/app/models/user.rb

  def create_book
       self.books.create(title: "Global",user_id: self.id)
---
INSERT INTO "books" ("user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["title", "Global"], ["created_at", "2021-01-17 10:53:54.512198"], ["updated_at", "2021-01-17 10:53:54.512198"]]