ruby_notes/app/views/notes/edit.html.erb

<div>
  <%= form.select :book_id, current_user.books.collect { |b| [b.title,b.id] } %>
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]