ruby_notes/app/views/notes/new.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
<div>
  <%= form.select :book_id, current_user.books.collect { |b| [b.title,b.id] } %>