ruby_notes/app/views/downloader/downloadall.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ?  [["book_id", 1]]
---
<div class="some-div">
  <%= @book.notes.each do |note| %>