ruby_notes/app/controllers/books_controller.rb

  def index
    @books = Book.where(user_id: current_user.id)
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]

  def update
    @books = current_user.books
    if @books.exists?(params[:id]) and !@books.exists?(title: params[:book][:title])
      @book = current_user.books.find(params[:id])
      @book.update(title: params[:book][:title])
---
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", nil], ["updated_at", "2021-01-13 10:11:35.275466"], ["id", 5]]

  def destroy
    if current_user.books.exists?(params[:id])
      @book = current_user.books.find(params[:id])
      if @book.title != "Global"
        @book.destroy
---
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 5]]