ruby_notes/app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def show
    if current_user.books.exists?(params[:id])
      @book = current_user.books.find(params[:id])

SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."title" = ? LIMIT ?  [["user_id", 1], ["title", "First book"], ["LIMIT", 1]]
INSERT INTO "books" ("user_id", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["title", "Third Book"], ["created_at", "2021-01-31 21:13:14.994464"], ["updated_at", "2021-01-31 21:13:14.994464"]]
---
  def create
    if params[:title].blank?
      flash.alert = "The title can't be blank"
      redirect_back(fallback_location: root_path)
    elsif current_user.books.exists?(title: params[:title])
      flash.alert = "The name is alredy in use"
      redirect_back(fallback_location: root_path)
    else
      current_user.books.create(title: params[:title], user_id: current_user.id)

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 18], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 18], ["LIMIT", 1]]
---
  def edit
    if current_user.books.exists?(params[:id])
      @book = current_user.books.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."title" = ? LIMIT ?  [["user_id", 1], ["title", "Second Book"], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 18], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 18], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "First book2"], ["updated_at", "2021-01-31 21:20:07.112925"], ["id", 18]]
---
  def update
    if params[:book][:title].blank?
      flash.alert = "The title can't be blank"
      redirect_back(fallback_location: root_path)
    elsif current_user.books.exists?(title: params[:book][:title])
      flash.alert = "The name is alredy in use"
      redirect_back(fallback_location: root_path)
    else

    @books = current_user.books
    if @books.exists?(params[:id])
      @book = current_user.books.find(params[:id])
      if @book.title == "Global"
        flash.alert = "Cant update Global book"
        redirect_to '/'
      end
      @book.update(title: params[:book][:title])

SELECT 1 AS one FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 10]]
---
  def destroy
    if current_user.books.exists?(params[:id])
      @book = current_user.books.find(params[:id])
      if @book.title != "Global"
        @book.destroy

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."book_id" = ?  [["book_id", 1]]
---
  def download_notes
    @notes = current_user.books.find(params[:book_id]).notes