ruby_notes/app/controllers/downloader_controller.rb

  def download
  if params[:type] == "Book"
    @book = current_user.books.find(params[:book_id])
    pdf = WickedPdf.new.pdf_from_string(            #1
      render_to_string('downloadall', layout: false))  #2
      send_data(pdf,                                  #3
        filename: 'download.pdf',                     #4
        type: 'application/pdf',                      #5
        disposition: 'attachment')                    #6
  else
  @note = Note.find(params[:note_id])
---
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]