ruby_notes/app/controllers/notes_controller.rb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def create
    if params[:title].blank?
      flash.alert = "The title can't be blank"
      redirect_back(fallback_location: root_path)
    elsif params[:content].blank?
      flash.alert = "The content can't be empty"
      redirect_back(fallback_location: root_path)
    else
    current_user.books.find(params[:book_id]).notes.create(title: params[:title],content:params[:content], book_id: params[:book_id])