ruby_notes/app/controllers/notes_controller.rb

  def show
    @books = current_user.books
    ok = false
    for book in @books
      if book.containNote(params[:id])
        @note = Note.where(id: params[:id]).first()
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
    current_user.books.find(params[:book_id]).notes.create(title: params[:title],content:params[:content], book_id: params[:book_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "notes" ("book_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["book_id", 1], ["title", "33"], ["content", "3"], ["created_at", "2021-01-31 20:05:11.452108"], ["updated_at", "2021-01-31 20:05:11.452108"]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ? AND "books"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def edit
    @books = current_user.books
    ok = false
    for book in @books
      if book.containNote(params[:id])
        @note = Note.where(id: params[:id]).first()
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @books = current_user.books
    ok = false
    for book in @books
      if book.containNote(params[:id])
        @note = Note.where(id: params[:id]).first()
        ok = true
        break
      end
    end
    if @note
      @note.update(title: params[:note][:title],content:params[:note][:content], book_id: params[:note][:book_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "notes" SET "book_id" = ?, "updated_at" = ? WHERE "notes"."id" = ?  [["book_id", 13], ["updated_at", "2021-01-31 20:05:34.047110"], ["id", 15]]

  def destroy
    @books = current_user.books
    ok = false
    for book in @books
      if book.containNote(params[:id])
        @note = Note.where(id: params[:id]).first()
        ok = true
        break
      end
    end
    if @note
      @note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? ORDER BY "notes"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 4]]

  def download
       @note = Note.find(params[:note_id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]